combined/BEEGFS-all-k8s-node/fio-k8s-read-buffered-block_128k-size_2G-threads_2.log
fio-beegfs-read-buffered-block_128k-size_2G-threads_2: (g=0): rw=rw, bs=128K-128K/128K-128K/128K-128K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-read-buffered-block_128k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)
fio-beegfs-read-buffered-block_128k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)

fio-beegfs-read-buffered-block_128k-size_2G-threads_2: (groupid=0, jobs=2): err= 0: pid=6554: Mon Nov 19 02:21:43 2018
  read : io=390525MB, bw=1627.2MB/s, iops=13017, runt=240001msec
    clat (usec): min=8, max=43290, avg=152.60, stdev=262.95
     lat (usec): min=8, max=43290, avg=152.69, stdev=262.97
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[    9], 20.00th=[   10],
     | 30.00th=[   10], 40.00th=[   10], 50.00th=[   10], 60.00th=[   11],
     | 70.00th=[   22], 80.00th=[  516], 90.00th=[  580], 95.00th=[  620],
     | 99.00th=[  700], 99.50th=[  764], 99.90th=[ 1064], 99.95th=[ 1192],
     | 99.99th=[ 1896]
    bw (KB  /s): min=528384, max=884992, per=50.04%, avg=833757.16, stdev=43547.06
    lat (usec) : 10=19.01%, 20=48.85%, 50=6.98%, 100=0.16%, 250=0.01%
    lat (usec) : 500=2.62%, 750=21.83%, 1000=0.42%
    lat (msec) : 2=0.12%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=1.00%, sys=70.25%, ctx=1599320, majf=0, minf=47199
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=3124197/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=390525MB, aggrb=1627.2MB/s, minb=1627.2MB/s, maxb=1627.2MB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 96.21%
  unit work: mean=55.09us, stddev=2.71