combined/BEEGFS-all-k8s-node/fio-k8s-read-buffered-block_512k-size_1G-threads_1.log
fio-beegfs-read-buffered-block_512k-size_1G-threads_1: (g=0): rw=rw, bs=512K-512K/512K-512K/512K-512K, ioengine=psync, iodepth=1
fio-2.2.10
Starting 1 process
fio-beegfs-read-buffered-block_512k-size_1G-threads_1: Laying out IO file(s) (4 file(s) / 4096MB)

fio-beegfs-read-buffered-block_512k-size_1G-threads_1: (groupid=0, jobs=1): err= 0: pid=1264: Sun Nov 18 20:09:10 2018
  read : io=262403MB, bw=1093.4MB/s, iops=2186, runt=240001msec
    clat (usec): min=308, max=11649, avg=455.40, stdev=48.75
     lat (usec): min=308, max=11649, avg=455.53, stdev=48.75
    clat percentiles (usec):
     |  1.00th=[  390],  5.00th=[  414], 10.00th=[  418], 20.00th=[  426],
     | 30.00th=[  434], 40.00th=[  442], 50.00th=[  450], 60.00th=[  462],
     | 70.00th=[  474], 80.00th=[  482], 90.00th=[  498], 95.00th=[  510],
     | 99.00th=[  540], 99.50th=[  556], 99.90th=[  604], 99.95th=[  620],
     | 99.99th=[ 1384]
    bw (MB  /s): min= 1026, max= 1272, per=100.00%, avg=1093.90, stdev=29.63
    lat (usec) : 500=91.29%, 750=8.69%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=0.69%, sys=67.36%, ctx=1215135, majf=0, minf=11445
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=524805/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=262403MB, aggrb=1093.4MB/s, minb=1093.4MB/s, maxb=1093.4MB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 87.12%
  unit work: mean=49.40us, stddev=2.25