combined/BEEGFS-all-k8s-node/fio-k8s-read-buffered-block_512k-size_2G-threads_2.log
fio-beegfs-read-buffered-block_512k-size_2G-threads_2: (g=0): rw=rw, bs=512K-512K/512K-512K/512K-512K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-read-buffered-block_512k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)
fio-beegfs-read-buffered-block_512k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)

fio-beegfs-read-buffered-block_512k-size_2G-threads_2: (groupid=0, jobs=2): err= 0: pid=6833: Mon Nov 19 02:45:52 2018
  read : io=442359MB, bw=1843.2MB/s, iops=3686, runt=240001msec
    clat (usec): min=360, max=44040, avg=540.67, stdev=146.42
     lat (usec): min=360, max=44040, avg=540.81, stdev=146.42
    clat percentiles (usec):
     |  1.00th=[  450],  5.00th=[  470], 10.00th=[  482], 20.00th=[  498],
     | 30.00th=[  510], 40.00th=[  524], 50.00th=[  532], 60.00th=[  540],
     | 70.00th=[  556], 80.00th=[  572], 90.00th=[  596], 95.00th=[  628],
     | 99.00th=[  812], 99.50th=[  972], 99.90th=[ 1160], 99.95th=[ 1224],
     | 99.99th=[ 5600]
    bw (KB  /s): min=608256, max=1015808, per=50.03%, avg=944208.91, stdev=48288.08
    lat (usec) : 500=22.84%, 750=75.73%, 1000=0.97%
    lat (msec) : 2=0.43%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=0.53%, sys=68.22%, ctx=1904866, majf=0, minf=15770
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=884718/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=442359MB, aggrb=1843.2MB/s, minb=1843.2MB/s, maxb=1843.2MB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 95.38%
  unit work: mean=54.66us, stddev=3.27