combined/BEEGFS-all-k8s-node/fio-k8s-read-buffered-block_64k-size_4G-threads_2.log
fio-beegfs-read-buffered-block_64k-size_4G-threads_2: (g=0): rw=rw, bs=64K-64K/64K-64K/64K-64K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-read-buffered-block_64k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-read-buffered-block_64k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)

fio-beegfs-read-buffered-block_64k-size_4G-threads_2: (groupid=0, jobs=2): err= 0: pid=7672: Mon Nov 19 04:21:38 2018
  read : io=382781MB, bw=1594.1MB/s, iops=25518, runt=240001msec
    clat (usec): min=4, max=50295, avg=77.50, stdev=220.20
     lat (usec): min=4, max=50295, avg=77.58, stdev=220.31
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    5], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    6], 80.00th=[   10], 90.00th=[  502], 95.00th=[  580],
     | 99.00th=[  676], 99.50th=[  716], 99.90th=[  980], 99.95th=[ 1112],
     | 99.99th=[ 2768]
    bw (KB  /s): min=581376, max=876416, per=50.03%, avg=817013.23, stdev=50098.47
    lat (usec) : 10=78.13%, 20=9.01%, 50=0.21%, 100=0.14%, 250=0.01%
    lat (usec) : 500=2.25%, 750=9.87%, 1000=0.29%
    lat (msec) : 2=0.08%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%
  cpu          : usr=1.50%, sys=68.92%, ctx=1554102, majf=0, minf=82358
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=6124488/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=382781MB, aggrb=1594.1MB/s, minb=1594.1MB/s, maxb=1594.1MB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 97.70%
  unit work: mean=56.00us, stddev=2.05