combined/BEEGFS-all-k8s-node/fio-k8s-read-unbuffered-block_1024k-size_4G-threads_2.log
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_2: (g=0): rw=rw, bs=1M-1M/1M-1M/1M-1M, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)

fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_2: (groupid=0, jobs=2): err= 0: pid=8549: Fri Nov 23 17:41:45 2018
  read : io=98353MB, bw=419632KB/s, iops=409, runt=240004msec
    clat (usec): min=3272, max=25475, avg=4878.33, stdev=739.63
     lat (usec): min=3273, max=25475, avg=4878.48, stdev=739.63
    clat percentiles (usec):
     |  1.00th=[ 4576],  5.00th=[ 4640], 10.00th=[ 4640], 20.00th=[ 4704],
     | 30.00th=[ 4704], 40.00th=[ 4704], 50.00th=[ 4768], 60.00th=[ 4768],
     | 70.00th=[ 4832], 80.00th=[ 4832], 90.00th=[ 4896], 95.00th=[ 5088],
     | 99.00th=[ 8896], 99.50th=[10432], 99.90th=[13376], 99.95th=[14144],
     | 99.99th=[15808]
    bw (KB  /s): min=189328, max=220302, per=50.05%, avg=210013.85, stdev=6886.43
    lat (msec) : 4=0.05%, 10=99.34%, 20=0.62%, 50=0.01%
  cpu          : usr=0.07%, sys=12.37%, ctx=460480, majf=0, minf=1948
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=98353/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=98353MB, aggrb=419632KB/s, minb=419632KB/s, maxb=419632KB/s, mint=240004msec, maxt=240004msec

CPU idleness:
  system: 94.19%
  unit work: mean=52.97us, stddev=1.76