combined/BEEGFS-all-k8s-node/fio-k8s-read-unbuffered-block_1024k-size_4G-threads_4.log
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_4: (g=0): rw=rw, bs=1M-1M/1M-1M/1M-1M, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 4 processes
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
[...]

fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_4: (groupid=0, jobs=4): err= 0: pid=12801: Sat Nov 24 04:12:52 2018
  read : io=114496MB, bw=488508KB/s, iops=477, runt=240004msec
    clat (msec): min=3, max=54, avg= 8.38, stdev= 1.29
     lat (msec): min=3, max=54, avg= 8.38, stdev= 1.29
    clat percentiles (usec):
     |  1.00th=[ 6560],  5.00th=[ 7840], 10.00th=[ 7904], 20.00th=[ 7968],
     | 30.00th=[ 8032], 40.00th=[ 8160], 50.00th=[ 8256], 60.00th=[ 8256],
     | 70.00th=[ 8256], 80.00th=[ 8384], 90.00th=[ 8512], 95.00th=[ 9792],
     | 99.00th=[14912], 99.50th=[16512], 99.90th=[19840], 99.95th=[23680],
     | 99.99th=[41216]
    bw (KB  /s): min=90176, max=135588, per=25.02%, avg=122244.49, stdev=4991.02
    lat (msec) : 4=0.01%, 10=95.51%, 20=4.40%, 50=0.09%, 100=0.01%
  cpu          : usr=0.04%, sys=8.03%, ctx=464540, majf=0, minf=2542
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=114496/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=114496MB, aggrb=488508KB/s, minb=488508KB/s, maxb=488508KB/s, mint=240004msec, maxt=240004msec

CPU idleness:
  system: 86.33%
  unit work: mean=48.64us, stddev=2.21